In [1]:
! pip3 install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
Requirement already satisfied: numpy in ./opt/anaconda3/lib/python3.7/site-packages (from pandasql) (1.17.2)
Requirement already satisfied: pandas in ./opt/anaconda3/lib/python3.7/site-packages (from pandasql) (0.25.1)
Requirement already satisfied: sqlalchemy in ./opt/anaconda3/lib/python3.7/site-packages (from pandasql) (1.3.9)
Requirement already satisfied: python-dateutil>=2.6.1 in ./opt/anaconda3/lib/python3.7/site-packages (from pandas->pandasql) (2.8.0)
Requirement already satisfied: pytz>=2017.2 in ./opt/anaconda3/lib/python3.7/site-packages (from pandas->pandasql) (2019.3)
Requirement already satisfied: six>=1.5 in ./opt/anaconda3/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas->pandasql) (1.12.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26819 sha256=92e5317050ecd1ac96a7ddc411710353a46947d2c0e3a9138c84905f4d0a6696
  Stored in directory: /Users/a.fedorova/Library/Caches/pip/wheels/5c/4b/ec/41f4e116c8053c3654e2c2a47c62b4fca34cc67ef7b55deb7f
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

# **Часть 1**

**In this task you should use Pandas to answer a few questions about the Adult dataset. (You don't have to download the data – it's already in the repository). **

**Choose the answers in the web-form. **

Unique values of all features (for more information, please see the links above):

* age: continuous.

* workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.

* fnlwgt: continuous.

* education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.

*  education-num: continuous.

* marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.

* occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.

* relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.

* race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.

* sex: Female, Male.

* capital-gain: continuous.

* capital-loss: continuous.

* hours-per-week: continuous.

* native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.

* salary: >50K,<=50K

In [39]:
import numpy as np
import pandas as pd
pd.set_option('display.max.columns', 100)
# to draw pictures in jupyter notebook
%matplotlib inline 
import matplotlib.pyplot as plt
import seaborn as sns
# we don't like warnings
# you can comment the following 2 lines if you'd like to
import warnings
warnings.filterwarnings('ignore')
import time

In [3]:
data = pd.read_csv('/Users/a.fedorova/Desktop/adult.csv')

In [4]:
data.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

**1. How many men and women (sex feature) are represented in this dataset?**

In [6]:
data['gender'].value_counts()

Male      32650
Female    16192
Name: gender, dtype: int64

***2. What is the average age (age feature) of women?***

In [7]:
data.loc[data['gender'] == 'Female', ['age']].mean()

age    36.927989
dtype: float64

***3. What is the percentage of German citizens (native-country feature)?***

In [8]:
#Всего граждан из Германии
(data['native-country'] == 'Germany').sum()

206

In [9]:
(data['native-country'] == 'Germany').sum()/data.shape[0]

0.00421768150362393

***4-5. What are the mean and standard deviation of age for those who earn more than 50K per year (salary feature) and those who earn less than 50K per year?***

In [11]:
poor_mean = data.loc[data['income'] == '<=50K', 'age'].mean()
poor_std = data.loc[data['income'] == '<=50K', 'age'].std()
rich_mean = data.loc[data['income'] == '>50K', 'age'].mean()
rich_std = data.loc[data['income'] == '>50K', 'age'].std()
print('Средний возраст бедных = {0} +- {1}'.format(round(poor_mean), round(poor_std, 1)))
print('Средний возраст богатых = {0} +- {1}'.format(round(rich_mean), round(rich_std, 1)))

Средний возраст бедных = 37 +- 14.1
Средний возраст богатых = 44 +- 10.6

***6. Is it true that people who earn more than 50K have at least high school education? (education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)***

In [13]:
data.loc[data['income'] == '>50K', 'education'].value_counts()

Bachelors       3313
HS-grad         2503
Some-college    2063
Masters         1459
Prof-school      617
Assoc-voc        522
Doctorate        431
Assoc-acdm       413
11th              92
10th              87
7th-8th           62
12th              48
9th               41
5th-6th           27
1st-4th            8
Preschool          1
Name: education, dtype: int64

***7. Display age statistics for each race (race feature) and each gender (sex feature). Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race.***

In [14]:
for (race, sex), sub_data in data.groupby(['race', 'gender']):
    print("Race: {0}, sex: {1}".format(race, sex))
    print(sub_data['age'].describe())

Race: Amer-Indian-Eskimo, sex: Female
count    185.000000
mean      36.237838
std       12.840056
min       17.000000
25%       26.000000
50%       35.000000
75%       46.000000
max       80.000000
Name: age, dtype: float64
Race: Amer-Indian-Eskimo, sex: Male
count    285.000000
mean      36.989474
std       11.703943
min       17.000000
25%       29.000000
50%       35.000000
75%       44.000000
max       82.000000
Name: age, dtype: float64
Race: Asian-Pac-Islander, sex: Female
count    517.000000
mean      35.657640
std       12.637799
min       17.000000
25%       25.000000
50%       34.000000
75%       44.000000
max       81.000000
Name: age, dtype: float64
Race: Asian-Pac-Islander, sex: Male
count    1002.000000
mean       38.994012
std        12.824878
min        18.000000
25%        29.000000
50%        37.000000
75%        46.000000
max        90.000000
Name: age, dtype: float64
Race: Black, sex: Female
count    2308.000000
mean       37.905979
std        12.736001
min        17.000000
25%        28.000000
50%        36.000000
75%        46.000000
max        90.000000
Name: age, dtype: float64
Race: Black, sex: Male
count    2377.000000
mean       37.922592
std        13.036981
min        17.000000
25%        28.000000
50%        36.000000
75%        46.000000
max        90.000000
Name: age, dtype: float64
Race: Other, sex: Female
count    155.000000
mean      31.212903
std       11.233061
min       17.000000
25%       23.000000
50%       29.000000
75%       37.000000
max       74.000000
Name: age, dtype: float64
Race: Other, sex: Male
count    251.000000
mean      35.167331
std       11.808297
min       17.000000
25%       26.000000
50%       32.000000
75%       42.500000
max       77.000000
Name: age, dtype: float64
Race: White, sex: Female
count    13027.000000
mean        36.882935
std         14.454178
min         17.000000
25%         25.000000
50%         35.000000
75%         47.000000
max         90.000000
Name: age, dtype: float64
Race: White, sex: Male
count    28735.000000
mean        39.704507
std         13.475250
min         17.000000
25%         29.000000
50%         38.000000
75%         49.000000
max         90.000000
Name: age, dtype: float64

**8. Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-status feature)? Consider as married those who have a marital-status starting with Married (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.**

In [16]:
data.loc[(data['gender'] == 'Male') &
     (data['marital-status'].isin(['Never-married', 
                                   'Separated', 
                                   'Divorced',
                                   'Widowed'])), 'income'].value_counts()

<=50K    11414
>50K      1001
Name: income, dtype: int64

In [17]:
data.loc[(data['gender'] == 'Male') &
     (data['marital-status'].str.startswith('Married')), 'income'].value_counts()

<=50K    11318
>50K      8917
Name: income, dtype: int64

**9. What is the maximum number of hours a person works per week (hours-per-week feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?**

In [19]:
max_time = data['hours-per-week'].max()
print('Максимальное число часов работы: {0}'.format(max_time))
print('Число людей, работающих {0} часов в неделю и их зарплаты:'.format(max_time))
print(data.loc[data['hours-per-week'] == max_time, 'income'].value_counts())
perc = ((data['hours-per-week'] == max_time) & (data['income'] == '>50K')).sum()/(data['hours-per-week'] == max_time).sum()*100
print('Процент людей, которые работают по  {0} часов и получают зарплату более 50k = {1}'.format(max_time, perc))

Максимальное число часов работы: 99
Число людей, работающих 99 часов в неделю и их зарплаты:
<=50K    96
>50K     41
Name: income, dtype: int64
Процент людей, которые работают по  99 часов и получают зарплату более 50k = 29.927007299270077

**10. Count the average time of work (hours-per-week) for those who earn a little and a lot (salary) for each country (native-country). What will these be for Japan?**

In [20]:
for (salary, native_country), sub_data in data.groupby(['income', 'native-country']):
  print("native-country: {0}, salary: {1}".format(native_country, salary))
  print(round(sub_data['hours-per-week'].mean(), 2))

native-country: ?, salary: <=50K
39.55
native-country: Cambodia, salary: <=50K
41.16
native-country: Canada, salary: <=50K
37.38
native-country: China, salary: <=50K
36.69
native-country: Columbia, salary: <=50K
39.12
native-country: Cuba, salary: <=50K
39.2
native-country: Dominican-Republic, salary: <=50K
41.56
native-country: Ecuador, salary: <=50K
37.95
native-country: El-Salvador, salary: <=50K
35.82
native-country: England, salary: <=50K
39.38
native-country: France, salary: <=50K
40.09
native-country: Germany, salary: <=50K
38.9
native-country: Greece, salary: <=50K
41.87
native-country: Guatemala, salary: <=50K
38.79
native-country: Haiti, salary: <=50K
36.41
native-country: Holand-Netherlands, salary: <=50K
40.0
native-country: Honduras, salary: <=50K
34.06
native-country: Hong, salary: <=50K
39.0
native-country: Hungary, salary: <=50K
34.08
native-country: India, salary: <=50K
38.04
native-country: Iran, salary: <=50K
39.97
native-country: Ireland, salary: <=50K
41.27
native-country: Italy, salary: <=50K
38.69
native-country: Jamaica, salary: <=50K
38.63
native-country: Japan, salary: <=50K
39.73
native-country: Laos, salary: <=50K
39.33
native-country: Mexico, salary: <=50K
39.93
native-country: Nicaragua, salary: <=50K
36.85
native-country: Outlying-US(Guam-USVI-etc), salary: <=50K
41.41
native-country: Peru, salary: <=50K
36.21
native-country: Philippines, salary: <=50K
38.01
native-country: Poland, salary: <=50K
37.23
native-country: Portugal, salary: <=50K
41.25
native-country: Puerto-Rico, salary: <=50K
38.91
native-country: Scotland, salary: <=50K
40.83
native-country: South, salary: <=50K
41.05
native-country: Taiwan, salary: <=50K
35.31
native-country: Thailand, salary: <=50K
43.04
native-country: Trinadad&Tobago, salary: <=50K
38.8
native-country: United-States, salary: <=50K
38.82
native-country: Vietnam, salary: <=50K
37.85
native-country: Yugoslavia, salary: <=50K
38.53
native-country: ?, salary: >50K
45.32
native-country: Cambodia, salary: >50K
43.89
native-country: Canada, salary: >50K
46.13
native-country: China, salary: >50K
42.03
native-country: Columbia, salary: >50K
56.25
native-country: Cuba, salary: >50K
42.85
native-country: Dominican-Republic, salary: >50K
42.8
native-country: Ecuador, salary: >50K
47.83
native-country: El-Salvador, salary: >50K
43.45
native-country: England, salary: >50K
46.3
native-country: France, salary: >50K
46.5
native-country: Germany, salary: >50K
45.71
native-country: Greece, salary: >50K
55.56
native-country: Guatemala, salary: >50K
36.67
native-country: Haiti, salary: >50K
40.67
native-country: Honduras, salary: >50K
50.0
native-country: Hong, salary: >50K
43.75
native-country: Hungary, salary: >50K
46.33
native-country: India, salary: >50K
46.27
native-country: Iran, salary: >50K
47.95
native-country: Ireland, salary: >50K
45.18
native-country: Italy, salary: >50K
45.65
native-country: Jamaica, salary: >50K
42.4
native-country: Japan, salary: >50K
47.06
native-country: Laos, salary: >50K
40.0
native-country: Mexico, salary: >50K
45.64
native-country: Nicaragua, salary: >50K
38.33
native-country: Outlying-US(Guam-USVI-etc), salary: >50K
40.0
native-country: Peru, salary: >50K
40.0
native-country: Philippines, salary: >50K
43.59
native-country: Poland, salary: >50K
39.59
native-country: Portugal, salary: >50K
46.75
native-country: Puerto-Rico, salary: >50K
39.9
native-country: Scotland, salary: >50K
46.67
native-country: South, salary: >50K
51.4
native-country: Taiwan, salary: >50K
45.54
native-country: Thailand, salary: >50K
53.0
native-country: Trinadad&Tobago, salary: >50K
40.0
native-country: United-States, salary: >50K
45.47
native-country: Vietnam, salary: >50K
39.43
native-country: Yugoslavia, salary: >50K
43.38

# **Часть 2**

In [21]:
user_usage = pd.read_csv('/Users/a.fedorova/Desktop/user_usage.csv')
user_device = pd.read_csv('/Users/a.fedorova/Desktop/user_device.csv')

In [22]:
user_usage.head()

   outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                    21.97                    4.82     1557.33   22787
1                  1710.08                  136.88     7267.55   22788
2                  1710.08                  136.88     7267.55   22789
3                    94.46                   35.17      519.12   22790
4                    71.59                   79.26     1557.33   22792

In [25]:
user_device.head()

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

#Pandas

In [42]:
start = time.time()
full1 = pd.merge(user_usage,
                 user_device,
                 on='use_id',
                 how = 'left')
end = time.time()
print('Time:',end - start)

Time: 0.003823995590209961

In [27]:
full1.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,user_id,platform,platform_version,device,use_type_id
0,21.97,4.82,1557.33,22787,12921.0,android,4.3,GT-I9505,1.0
1,1710.08,136.88,7267.55,22788,28714.0,android,6.0,SM-G930F,1.0
2,1710.08,136.88,7267.55,22789,28714.0,android,6.0,SM-G930F,1.0
3,94.46,35.17,519.12,22790,29592.0,android,5.1,D2303,1.0
4,71.59,79.26,1557.33,22792,28217.0,android,5.1,SM-G361F,1.0

In [28]:
full1.tail()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,user_id,platform,platform_version,device,use_type_id
235,260.66,68.44,896.96,25008,NaN,NaN,NaN,NaN,NaN
236,97.12,36.50,2815.00,25040,NaN,NaN,NaN,NaN,NaN
237,355.93,12.37,6828.09,25046,NaN,NaN,NaN,NaN,NaN
238,632.06,120.46,1453.16,25058,NaN,NaN,NaN,NaN,NaN
239,488.70,906.92,3089.85,25220,NaN,NaN,NaN,NaN,NaN

Можно заметить, что появляются нулевые поля так как я использовала left join. То есть в итоговую таблицу помещаются те значения, которые ест в первой таблице, но их нет во второй таблице.

In [51]:
start = time.time()
print(full1.groupby('platform', as_index=False).agg(
    {'outgoing_mins_per_month' : ['sum', 'min', 'mean', 'max']}
))
end = time.time()
print('Time:',end - start)

  platform outgoing_mins_per_month
                               sum    min        mean      max
0  android                31597.59   0.50  201.258535  1710.08
1      ios                  732.12  50.68  366.060000   681.44
Time: 0.00840902328491211

Вывела для трех значений максимум, среднее, минимум, сумму (с помощью функции **агрегации**)

# PandaSQL

In [30]:
import pandasql as ps

In [37]:
def example_query(full1):
    simple_query = '''
        SELECT 
            outgoing_mins_per_month, 
            monthly_mb,
            platform
        FROM full1 
        where 1=1
        and monthly_mb >= 100
        and platform = 'ios'
        LIMIT 15
        '''
    return ps.sqldf(simple_query, locals())

In [38]:
example_query(full1)

   outgoing_mins_per_month  monthly_mb platform
0                   681.44     1271.39      ios
1                    50.68      650.92      ios

In [52]:
def aggr_query(full1):
    aggr_query = '''
        SELECT 
            platform,
            Min(outgoing_mins_per_month),
            Max(outgoing_mins_per_month),
            Sum(outgoing_mins_per_month)
        FROM full1 
       group by platform
        '''
    return ps.sqldf(aggr_query, locals())

In [53]:
start = time.time()
print(aggr_query(full1))
end = time.time()
print('Time:',end - start)

  platform  Min(outgoing_mins_per_month)  Max(outgoing_mins_per_month)  \
0     None                         15.52                       1816.63
1  android                          0.50                       1710.08
2      ios                         50.68                        681.44

   Sum(outgoing_mins_per_month)
0                      33564.49
1                      31597.59
2                        732.12
Time: 0.013413190841674805

In [35]:
def join_query(user_usage, user_device):
  join_query = '''
  select *
  from user_usage t0
  join user_device t1
  on t0.use_id = t1.use_id'''
  
  return ps.sqldf(join_query)

In [49]:
start = time.time()
print(join_query(user_usage, user_device))
end = time.time()
print('Time:',end - start)

     outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id  \
0                      21.97                    4.82     1557.33   22787
1                    1710.08                  136.88     7267.55   22788
2                    1710.08                  136.88     7267.55   22789
3                      94.46                   35.17      519.12   22790
4                      71.59                   79.26     1557.33   22792
..                       ...                     ...         ...     ...
154                   198.59                   90.49     5191.12   23043
155                   198.59                   90.49     3114.67   23044
156                   106.65                   82.13     5191.12   23046
157                   344.53                   20.53      519.12   23049
158                    42.75                   46.83     5191.12   23053

     use_id  user_id platform  platform_version                  device  \
0     22787    12921  android               4.3                GT-I9505
1     22788    28714  android               6.0                SM-G930F
2     22789    28714  android               6.0                SM-G930F
3     22790    29592  android               5.1                   D2303
4     22792    28217  android               5.1                SM-G361F
..      ...      ...      ...               ...                     ...
154   23043    28953  android               6.0                SM-G900F
155   23044    28953  android               6.0                SM-G900F
156   23046    29454  android               6.0              Moto G (4)
157   23049    29725  android               6.0                SM-G900F
158   23053    20257  android               5.1  Vodafone Smart ultra 6

     use_type_id
0              1
1              1
2              1
3              1
4              1
..           ...
154            1
155            1
156            1
157            1
158            1

[159 rows x 10 columns]
Time: 0.039853811264038086